#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=d5b8019e988cf130c7b7cfd5968d1c70ded751cc]
null_resource.always_run: Refreshing state... [id=4423917090225496368]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=7359566548296610395]
proxmox_vm_qemu.gateway-1: Refreshing state... [id=milky-capella/qemu/122]
proxmox_vm_qemu.k3s-manager-controller-01: Refreshing state... [id=milky-capella/qemu/1001]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/2005]
proxmox_vm_qemu.k3s-manager-worker-01: Refreshing state... [id=milky-polaris/qemu/1002]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]
proxmox_vm_qemu.workstation-1: Refreshing state... [id=milky-polaris/qemu/123]
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/2004]
proxmox_vm_qemu.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/qemu/2003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "4423917090225496368" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-10-08T14:50:21Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "7359566548296610395" -> (known after apply)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/2003"
        name                   = "solufit-cloudflare-tunnel-1"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      ~ boot                   = "order=scsi0" -> (known after apply)
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
      ~ default_ipv4_address   = "10.0.0.51" -> (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "milky-polaris/qemu/2004" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "solufit-cloudflare-tunnel-2"
      + nameserver             = (known after apply)
      - numa                   = false -> null
      - qemu_os                = "other" -> null
      ~ reboot_required        = false -> (known after apply)
      + searchdomain           = (known after apply)
      ~ ssh_host               = "10.0.0.51" -> (known after apply)
      ~ ssh_port               = "22" -> (known after apply)
      ~ sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT
      + tags                   = (known after apply)
      ~ unused_disk            = [] -> (known after apply)
        # (55 unchanged attributes hidden)

      ~ disks {
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      ~ id                   = 0 -> (known after apply)
                      - iothread             = false -> null
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (18 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      ~ network {
          ~ macaddr   = "B2:C8:12:F6:3D:A8" -> (known after apply)
          ~ queues    = 0 -> (known after apply)
          ~ rate      = 0 -> (known after apply)
            # (6 unchanged attributes hidden)
        }
      ~ network {
          ~ macaddr   = "9E:EE:1A:04:6A:9B" -> (known after apply)
          - mtu       = 0 -> null
          ~ queues    = 0 -> (known after apply)
          ~ rate      = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ smbios {
          + additional_wait             = (known after apply)
          + agent                       = (known after apply)
          + agent_timeout               = (known after apply)
          + args                        = (known after apply)
          + automatic_reboot            = (known after apply)
          + balloon                     = (known after apply)
          + bios                        = (known after apply)
          + boot                        = (known after apply)
          + bootdisk                    = (known after apply)
          + ci_wait                     = (known after apply)
          + cicustom                    = (known after apply)
          + cipassword                  = (known after apply)
          + ciuser                      = (known after apply)
          + clone                       = (known after apply)
          + clone_wait                  = (known after apply)
          + cores                       = (known after apply)
          + cpu                         = (known after apply)
          + default_ipv4_address        = (known after apply)
          + default_ipv6_address        = (known after apply)
          + define_connection_info      = (known after apply)
          + desc                        = (known after apply)
          + force_create                = (known after apply)
          + force_recreate_on_change_of = (known after apply)
          + full_clone                  = (known after apply)
          + hagroup                     = (known after apply)
          + hastate                     = (known after apply)
          + hotplug                     = (known after apply)
          + id                          = (known after apply)
          + ipconfig0                   = (known after apply)
          + ipconfig1                   = (known after apply)
          + ipconfig10                  = (known after apply)
          + ipconfig11                  = (known after apply)
          + ipconfig12                  = (known after apply)
          + ipconfig13                  = (known after apply)
          + ipconfig14                  = (known after apply)
          + ipconfig15                  = (known after apply)
          + ipconfig2                   = (known after apply)
          + ipconfig3                   = (known after apply)
          + ipconfig4                   = (known after apply)
          + ipconfig5                   = (known after apply)
          + ipconfig6                   = (known after apply)
          + ipconfig7                   = (known after apply)
          + ipconfig8                   = (known after apply)
          + ipconfig9                   = (known after apply)
          + kvm                         = (known after apply)
          + linked_vmid                 = (known after apply)
          + machine                     = (known after apply)
          + memory                      = (known after apply)
          + name                        = (known after apply)
          + nameserver                  = (known after apply)
          + numa                        = (known after apply)
          + onboot                      = (known after apply)
          + os_network_config           = (known after apply)
          + os_type                     = (known after apply)
          + pool                        = (known after apply)
          + protection                  = (known after apply)
          + pxe                         = (known after apply)
          + qemu_os                     = (known after apply)
          + reboot_required             = (known after apply)
          + scsihw                      = (known after apply)
          + searchdomain                = (known after apply)
          + skip_ipv4                   = (known after apply)
          + skip_ipv6                   = (known after apply)
          + sockets                     = (known after apply)
          + ssh_forward_ip              = (known after apply)
          + ssh_host                    = (known after apply)
          + ssh_port                    = (known after apply)
          + ssh_private_key             = (known after apply)
          + ssh_user                    = (known after apply)
          + sshkeys                     = (known after apply)
          + startup                     = (known after apply)
          + tablet                      = (known after apply)
          + tags                        = (known after apply)
          + target_node                 = (known after apply)
          + target_nodes                = (known after apply)
          + unused_disk                 = (known after apply)
          + vcpus                       = (known after apply)
          + vm_state                    = (known after apply)
          + vmid                        = (known after apply)
        } -> (known after apply)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2005"
        name                   = "solufit-cloudflare-tunnel-3"
        tags                   = null
        # (68 unchanged attributes hidden)

      ~ network {
          ~ mtu       = 0 -> 1400
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.gateway-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "gateway-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/122"
        name                   = "ssh-gateway-1"
        tags                   = null
        # (67 unchanged attributes hidden)

      ~ network {
          ~ mtu       = 0 -> 1400
            # (8 unchanged attributes hidden)
        }
      ~ network {
          ~ mtu       = 0 -> 1400
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (68 unchanged attributes hidden)

      ~ network {
          ~ mtu       = 0 -> 1400
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-01" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1001"
        name                   = "solufit-k3s-controller-01"
        tags                   = null
        # (67 unchanged attributes hidden)

      ~ network {
          ~ mtu       = 0 -> 1400
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-01" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/1002"
        name                   = "solufit-k3s-worker-01"
        tags                   = null
        # (67 unchanged attributes hidden)

      ~ network {
          ~ mtu       = 0 -> 1400
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.workstation-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "workstation-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/123"
        name                   = "workstation-1"
        tags                   = null
        # (67 unchanged attributes hidden)

      ~ network {
          ~ mtu       = 0 -> 1400
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 7 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*